{
  "careers": [
    {
      "id": 1,
      "title": "Senior Software Engineer",
      "salary": 5000,
      "location": "Nairobi",
      "company": "Amazon",
      "description": "Design web and mobile applications, testing and documentation",
      "type": "full-time",
      "posted": "30/1/2023",
      "experience": 4,
      "skills": "react, js, html, css, scrum",
      "details": "The company is seeking a Software Engineer with expertise in Guidewire GOSU to join their cross-functional team in the E&S insurance segment. The engineer will collaborate with various teams to enhance and maintain systems supporting business processes. Responsibilities include delivering solutions, implementing features, estimating tasks, conducting testing, debugging, and staying updated on software design best practices. The role involves active participation in an agile development environment, effective communication with stakeholders, and contributing to application support issue resolutions. Qualifications include a Bachelor's degree or equivalent experience, critical thinking, problem-solving, and time-management skills. The candidate should be a team player with excellent interpersonal and communication skills, self-motivated, and have at least 1+ years of experience in Guidewire Policy Center development using GOSU or Java. Familiarity with Guidewire Studio and Configuration, Agile software development practices, XML, XSLT, XSD, and automated testing (e.g., Selenium) is beneficial. The company does not accept unsolicited resumes from external recruiting agencies or firms."
    },
    {
      "id": 2,
      "title": "UX/UI Designer",
      "salary": 4000,
      "location": "Mombasa",
      "company": "Google",
      "description": "Design user experiences and user interfaces for web and mobile applications.",
      "type": "full-time",
      "posted": "15/2/2023",
      "experience": 3,
      "skills": "wireframing, prototyping, Adobe XD, Sketch",
      "details": "We are looking for a talented UX/UI Designer to create amazing user experiences and interfaces. The ideal candidate should have an eye for clean and artful design, possess superior UX/UI skills, and be able to translate high-level requirements into interaction flows and artifacts. You will be responsible for creating wireframes, storyboards, user flows, and prototypes to effectively communicate interaction and design ideas. Proficiency in Adobe XD, Sketch, or other design tools is a must. The candidate should have at least 2+ years of experience in designing web and mobile applications, a strong portfolio demonstrating user-centered design, and excellent collaboration and communication skills."
    },
    {
      "id": 3,
      "title": "Data Scientist",
      "salary": 5500,
      "location": "Kisumu",
      "company": "Microsoft",
      "description": "Analyze large datasets, develop machine learning models, and derive insights.",
      "type": "full-time",
      "posted": "10/3/2023",
      "experience": 5,
      "skills": "Python, R, machine learning, data visualization",
      "details": "Microsoft is seeking a Data Scientist to work on a wide range of data-driven projects. The ideal candidate should be proficient in Python, R, and machine learning techniques. You will be responsible for analyzing large datasets, developing predictive models, and deriving actionable insights. Strong knowledge of data visualization tools and techniques is essential for effective communication of results. Qualifications include a Master's or Ph.D. degree in a relevant field, a deep understanding of statistical methods, and hands-on experience in working with real-world datasets. Strong problem-solving skills, adaptability, and the ability to work in a collaborative environment are highly valued."
    },
    {
      "id": 4,
      "title": "Product Manager",
      "salary": 4800,
      "location": "Nakuru",
      "company": "Apple",
      "description": "Manage product development lifecycle and drive product strategy.",
      "type": "full-time",
      "posted": "5/4/2023",
      "experience": 4,
      "skills": "product management, Agile, market research",
      "details": "Apple is looking for an experienced Product Manager to lead the development of innovative products. The candidate should have a proven track record in product management, from concept to launch. Responsibilities include defining product requirements, conducting market research, and collaborating with cross-functional teams to drive product strategy and development. Strong knowledge of Agile methodologies and the ability to prioritize features based on customer needs and business goals are essential. The candidate should have at least 3+ years of experience in product management, excellent project management skills, and the ability to thrive in a fast-paced, dynamic environment."
    },
    {
      "id": 5,
      "title": "Sales Executive",
      "salary": 3500,
      "location": "Eldoret",
      "company": "Salesforce",
      "description": "Generate leads, build relationships, and close deals with potential clients.",
      "type": "full-time",
      "posted": "20/5/2023",
      "experience": 2,
      "skills": "sales, negotiation, communication",
      "details": "Salesforce is seeking a Sales Executive to join its high-energy sales team. The candidate should be self-motivated, results-driven, and possess excellent communication and negotiation skills. Responsibilities include prospecting potential clients, conducting sales presentations, and closing deals. You will be responsible for generating and managing leads through the entire sales cycle. The candidate should have at least 1+ years of experience in B2B sales, a proven track record of achieving sales targets, and the ability to thrive in a competitive sales environment. Knowledge of CRM software and sales automation tools is beneficial."
    },
    {
      "id": 6,
      "title": "Network Administrator",
      "salary": 4200,
      "location": "Machakos",
      "company": "Cisco",
      "description": "Configure and maintain network infrastructure for optimal performance.",
      "type": "full-time",
      "posted": "1/6/2023",
      "experience": 3,
      "skills": "networking, Cisco, troubleshooting",
      "details": "Cisco is looking for a skilled Network Administrator to manage and maintain their network infrastructure. The candidate should have hands-on experience in configuring and troubleshooting network devices, including routers, switches, and firewalls. Responsibilities include monitoring network performance, resolving network issues, and implementing security measures. The ideal candidate should have at least 2+ years of experience in network administration, a strong understanding of TCP/IP protocols, and a Cisco certification (CCNA or CCNP). Knowledge of network monitoring tools and scripting languages is a plus."
    },
    {
      "id": 7,
      "title": "Human Resources Specialist",
      "salary": 3800,
      "location": "Kisii",
      "company": "IBM",
      "description": "Manage HR operations, recruitment, and employee relations.",
      "type": "full-time",
      "posted": "12/7/2023",
      "experience": 4,
      "skills": "human resources, recruitment, employee engagement",
      "details": "IBM is seeking a Human Resources Specialist to support the HR operations and employee engagement initiatives. The candidate should have a strong background in human resources, including recruitment, onboarding, and employee relations. Responsibilities include managing HR processes, conducting interviews, and developing strategies to improve employee satisfaction. The ideal candidate should have at least 3+ years of experience in HR, excellent interpersonal skills, and the ability to handle sensitive HR issues with confidentiality. Knowledge of HR software and analytics is an advantage."
    },
    {
      "id": 8,
      "title": "Financial Analyst",
      "salary": 4500,
      "location": "Nyeri",
      "company": "JP Morgan",
      "description": "Analyze financial data and provide insights for decision-making.",
      "type": "full-time",
      "posted": "25/8/2023",
      "experience": 3,
      "skills": "financial analysis, Excel, data interpretation",
      "details": "JP Morgan is looking for a Financial Analyst to join their finance team. The candidate should have a strong analytical mindset, proficiency in financial modeling, and the ability to interpret complex data. Responsibilities include analyzing financial statements, preparing reports, and providing recommendations for business improvements. The ideal candidate should have at least 2+ years of experience in financial analysis, a degree in finance or related field, and advanced Excel skills. Knowledge of financial software and the ability to work with large datasets are beneficial."
    },
    {
      "id": 9,
      "title": "Marketing Manager",
      "salary": 4800,
      "location": "Embu",
      "company": "Facebook",
      "description": "Develop marketing strategies and drive brand awareness.",
      "type": "full-time",
      "posted": "9/9/2023",
      "experience": 5,
      "skills": "marketing, brand management, social media",
      "details": "Facebook is seeking a Marketing Manager to lead the development and execution of marketing strategies. The candidate should have a deep understanding of digital marketing, brand management, and social media platforms. Responsibilities include planning and executing marketing campaigns, analyzing market trends, and measuring the effectiveness of marketing efforts. The ideal candidate should have at least 4+ years of experience in marketing, a proven track record of successful marketing campaigns, and excellent project management skills. A degree in marketing or related field is preferred."
    },
    {
      "id": 10,
      "title": "Software Quality Assurance Engineer",
      "salary": 4200,
      "location": "Nairobi",
      "company": "Netflix",
      "description": "Ensure software quality through testing and QA processes.",
      "type": "full-time",
      "posted": "4/10/2023",
      "experience": 3,
      "skills": "QA testing, test automation, bug tracking",
      "details": "Netflix is looking for a Software Quality Assurance Engineer to ensure the quality and reliability of their software products. The candidate should have experience in manual and automated testing, as well as a strong understanding of QA processes and methodologies. Responsibilities include writing test plans, executing test cases, and tracking defects to resolution. The ideal candidate should have at least 2+ years of experience in software QA, excellent problem-solving skills, and the ability to work in a fast-paced, Agile development environment. Knowledge of test automation tools and programming languages is a plus."
    },
    {
      "id": 11,
      "title": "Project Manager",
      "salary": 5000,
      "location": "Thika",
      "company": "IBM",
      "description": "Lead project teams and deliver projects on time and within budget.",
      "type": "full-time",
      "posted": "15/11/2023",
      "experience": 5,
      "skills": "project management, team leadership, risk assessment",
      "details": "IBM is seeking a skilled Project Manager to lead and deliver various projects. The candidate should have a strong background in project management, including project planning, resource allocation, and risk assessment. Responsibilities include coordinating project teams, managing project schedules, and ensuring successful project delivery. The ideal candidate should have at least 4+ years of experience in project management, excellent leadership skills, and the ability to work with cross-functional teams. PMP or PRINCE2 certification is a plus."
    },
    {
      "id": 12,
      "title": "DevOps Engineer",
      "salary": 4800,
      "location": "Nairobi",
      "company": "Microsoft",
      "description": "Automate and streamline development and deployment processes.",
      "type": "full-time",
      "posted": "5/12/2023",
      "experience": 4,
      "skills": "DevOps, CI/CD, cloud infrastructure",
      "details": "Microsoft is looking for a DevOps Engineer to join their cloud services team. The candidate should have hands-on experience in building and maintaining CI/CD pipelines, as well as managing cloud infrastructure. Responsibilities include automating and streamlining development and deployment processes, monitoring system performance, and troubleshooting issues. The ideal candidate should have at least 3+ years of experience in DevOps, proficiency in scripting languages, and strong knowledge of cloud platforms such as Azure or AWS."
    },
    {
      "id": 13,
      "title": "Data Analyst",
      "salary": 4000,
      "location": "Mombasa",
      "company": "Google",
      "description": "Extract, transform, and analyze data for business insights.",
      "type": "full-time",
      "posted": "10/1/2024",
      "experience": 3,
      "skills": "data analysis, SQL, data visualization",
      "details": "Google is seeking a Data Analyst to work on data-driven projects. The candidate should have a strong background in data analysis, including data extraction, transformation, and visualization. Responsibilities include querying and analyzing large datasets, generating reports, and providing insights for business decisions. The ideal candidate should have at least 2+ years of experience in data analysis, proficiency in SQL and data visualization tools, and the ability to work with diverse data sources. A degree in data science, statistics, or a related field is preferred."
    },
    {
      "id": 14,
      "title": "Cybersecurity Specialist",
      "salary": 5000,
      "location": "Kisumu",
      "company": "Amazon",
      "description": "Protect the organization's IT systems and data from security threats.",
      "type": "full-time",
      "posted": "22/2/2024",
      "experience": 5,
      "skills": "cybersecurity, network security, incident response",
      "details": "Amazon is looking for a Cybersecurity Specialist to ensure the security and integrity of their IT systems and data. The candidate should have a strong understanding of cybersecurity principles, network security, and incident response procedures. Responsibilities include monitoring and detecting security threats, conducting vulnerability assessments, and implementing security measures. The ideal candidate should have at least 4+ years of experience in cybersecurity, relevant certifications (e.g., CISSP, CEH), and excellent problem-solving skills."
    },
    {
      "id": 15,
      "title": "Customer Support Representative",
      "salary": 3500,
      "location": "Nakuru",
      "company": "Salesforce",
      "description": "Provide timely and effective customer support via various channels.",
      "type": "full-time",
      "posted": "8/3/2024",
      "experience": 2,
      "skills": "customer service, problem-solving, communication",
      "details": "Salesforce is seeking a Customer Support Representative to assist their customers with any inquiries or issues they may have. The candidate should have excellent communication and problem-solving skills, as well as the ability to empathize with customers. Responsibilities include handling customer queries, troubleshooting technical issues, and providing timely solutions. The ideal candidate should have at least 1+ years of experience in customer service, a friendly and approachable demeanor, and the ability to work in a fast-paced environment."
    }
  ],

  "employers": [
    {
      "id": 1,
      "title": "Senior Software Engineer",
      "salary": 5000,
      "location": "Nairobi",
      "company": "Amazon",
      "description": "Design web and mobile applications, testing and documentation",
      "type": "full-time",
      "posted": "30/1/2023",
      "experience": 4,
      "skills": "react, js, html, css, scrum",
      "details": "The company is seeking a Software Engineer with expertise in Guidewire GOSU to join their cross-functional team in the E&S insurance segment. The engineer will collaborate with various teams to enhance and maintain systems supporting business processes. Responsibilities include delivering solutions, implementing features, estimating tasks, conducting testing, debugging, and staying updated on software design best practices. The role involves active participation in an agile development environment, effective communication with stakeholders, and contributing to application support issue resolutions. Qualifications include a Bachelor's degree or equivalent experience, critical thinking, problem-solving, and time-management skills. The candidate should be a team player with excellent interpersonal and communication skills, self-motivated, and have at least 1+ years of experience in Guidewire Policy Center development using GOSU or Java. Familiarity with Guidewire Studio and Configuration, Agile software development practices, XML, XSLT, XSD, and automated testing (e.g., Selenium) is beneficial. The company does not accept unsolicited resumes from external recruiting agencies or firms."
    },
    {
      "id": 2,
      "title": "UX/UI Designer",
      "salary": 4000,
      "location": "Mombasa",
      "company": "Google",
      "description": "Design user experiences and user interfaces for web and mobile applications.",
      "type": "full-time",
      "posted": "15/2/2023",
      "experience": 3,
      "skills": "wireframing, prototyping, Adobe XD, Sketch",
      "details": "We are looking for a talented UX/UI Designer to create amazing user experiences and interfaces. The ideal candidate should have an eye for clean and artful design, possess superior UX/UI skills, and be able to translate high-level requirements into interaction flows and artifacts. You will be responsible for creating wireframes, storyboards, user flows, and prototypes to effectively communicate interaction and design ideas. Proficiency in Adobe XD, Sketch, or other design tools is a must. The candidate should have at least 2+ years of experience in designing web and mobile applications, a strong portfolio demonstrating user-centered design, and excellent collaboration and communication skills."
    },
    {
      "id": 3,
      "title": "Data Scientist",
      "salary": 5500,
      "location": "Kisumu",
      "company": "Microsoft",
      "description": "Analyze large datasets, develop machine learning models, and derive insights.",
      "type": "full-time",
      "posted": "10/3/2023",
      "experience": 5,
      "skills": "Python, R, machine learning, data visualization",
      "details": "Microsoft is seeking a Data Scientist to work on a wide range of data-driven projects. The ideal candidate should be proficient in Python, R, and machine learning techniques. You will be responsible for analyzing large datasets, developing predictive models, and deriving actionable insights. Strong knowledge of data visualization tools and techniques is essential for effective communication of results. Qualifications include a Master's or Ph.D. degree in a relevant field, a deep understanding of statistical methods, and hands-on experience in working with real-world datasets. Strong problem-solving skills, adaptability, and the ability to work in a collaborative environment are highly valued."
    },
    {
      "id": 4,
      "title": "Product Manager",
      "salary": 4800,
      "location": "Nakuru",
      "company": "Apple",
      "description": "Manage product development lifecycle and drive product strategy.",
      "type": "full-time",
      "posted": "5/4/2023",
      "experience": 4,
      "skills": "product management, Agile, market research",
      "details": "Apple is looking for an experienced Product Manager to lead the development of innovative products. The candidate should have a proven track record in product management, from concept to launch. Responsibilities include defining product requirements, conducting market research, and collaborating with cross-functional teams to drive product strategy and development. Strong knowledge of Agile methodologies and the ability to prioritize features based on customer needs and business goals are essential. The candidate should have at least 3+ years of experience in product management, excellent project management skills, and the ability to thrive in a fast-paced, dynamic environment."
    }
  ],
  "faq": [
    {
      "id": 2011,
      "question": "How do I close account?",
      "answer": "Instead of closing your account, you have the option to pause your alerts. You can also set your resume to private so that your information is not searchable on Skill Hunter. \n\n If you wish to use Skill Hunter again after closing your account, you can create a new account using the same or any other email address, however, you will not have access to any of your original information."
    },
    {
      "id": 2012,
      "question": "How do I reset my password?",
      "answer": "If you would like to reset your password, please visit the Sign In link in the upper right corner of any Skill Hunter page.\n\n Click Forgot Your Password? at the bottom of the login box, then enter the email address associated with your Skill Hunter account and click Submit. \n\nCheck your spam or junk folder if you don't see the email in your inbox. Be sure to click the link as soon as you receive it - it's valid for 24 hours."
    },
    {
      "id": 2013,
      "question": "I can't Sign in to My account?",
      "answer": "If you would like to reset your password, please visit the Sign in link in the upper right-hand corner of any Skill Hunter page. \n\n Click Forgot Your Password? at the bottom of the login box, enter the email address associated with your Skill Hunter account and click Submit. Check your spam or junk folder if you don't see the email in your inbox.  \n\n If you accidentally created an Skill Hunter account with a typo in your email or if you no longer have access to the email address, unfortunately, you will not be able to recover the password for the account and will need to create a new account. "
    },
    {
      "id": 2021,
      "question": "How can I upload my cv using Skill Hunter app?",
      "answer": "Use the upload feature in the user's page to upload your cv"
    },
    {
      "id": 2022,
      "question": "How to apply for a job in Skill Hunter?",
      "answer": "We are so happy you are choosing to use Skill Hunter to assist in your job search! Please note that Skill Hunter does not operate as a recruiting service, but rather functions as a job search engine. \n\n To apply for jobs on Skill Hunter, first navigate to our homepage. Here you will find a search bar, you can enter your desired keywords related to the type of job you’re looking for, a company name, or industry you would like to work in.Once you have your search set up, click  view  details."
    },
    {
      "id": 2023,
      "question": "Improving Your Skill Hunter Job Searches (Tips and Help)",
      "answer": " Employers post hundreds of new jobs every month. Sifting through so many jobs can be hard, frustrating, and sometimes stressful. Our goal in this article is to help you maximize your job search and connect you to the right employers.To do that use keyword combinations in the search bar"
    }
  ]
}
